###############################################################
#  Generated by:      Cadence Innovus 20.14-s095_1
#  OS:                Linux x86_64(Host ID lenovo-56.pilani.bits-pilani.ac.in)
#  Generated on:      Wed Mar 18 15:47:16 2026
#  Design:            asynchronous_fifo
###############################################################
current_design asynchronous_fifo
set_clock_gating_check -rise -setup 0.2  -hold 0.1 
set_clock_gating_check -fall -setup 0.2  -hold 0.1 
create_clock [get_ports {rclk}]  -name rclk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_clocks {rclk}]
create_clock [get_ports {wclk}]  -name wclk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_clocks {wclk}]
set_propagated_clock  [get_ports {rclk}]
set_propagated_clock  [get_ports {wclk}]
set_wire_load_mode enclosed
set_max_fanout 10  [get_designs {asynchronous_fifo}]
set_max_transition 0.5  [get_designs {asynchronous_fifo}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_in[4]}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_in[2]}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {w_en}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_in[0]}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {rst}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_in[7]}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_in[5]}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_in[3]}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_in[1]}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {r_en}]
set_input_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_in[6]}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {empty}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_out[7]}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_out[5]}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_out[3]}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_out[1]}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_out[6]}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_out[4]}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_out[2]}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {full}]
set_output_delay -add_delay 2 -clock [get_clocks {rclk}] [get_ports {data_out[0]}]
set_clock_uncertainty 0.2 [get_clocks {wclk}]
set_clock_uncertainty 0.2 [get_clocks {rclk}]
set_clock_latency -source -early -max -rise  0.0741586 [get_ports {rclk}] -clock rclk 
set_clock_latency -source -early -max -fall  0.0963585 [get_ports {rclk}] -clock rclk 
set_clock_latency -source -late -max -rise  0.0741586 [get_ports {rclk}] -clock rclk 
set_clock_latency -source -late -max -fall  0.0963585 [get_ports {rclk}] -clock rclk 
set_clock_latency -source -early -max -rise  0.0081895 [get_ports {wclk}] -clock wclk 
set_clock_latency -source -early -max -fall  0.038583 [get_ports {wclk}] -clock wclk 
set_clock_latency -source -late -max -rise  0.0081895 [get_ports {wclk}] -clock wclk 
set_clock_latency -source -late -max -fall  0.038583 [get_ports {wclk}] -clock wclk 
